In [256]:
import pandas as pd
import numpy as np

#import matplotlib.pyplot as plt
#%matplotlib inline

df = pd.DataFrame({'year':[2001,2002,2003,2004,2005],'price':[11,13,None,14,17]})
df = df.fillna(method='ffill',axis=0).fillna(0)

total_cells = np.product(df.shape)
print(f"total cells = {total_cells}")
#df

total cells = 10

In [257]:
#df.plot.bar('year','price',title='Dem 1',fontsize=13);

In [258]:
def ll(rows):
    if rows.year < 2002:
        return 2000
    else:
        return rows.year

In [259]:
df.year = df.apply(ll,axis=1)
df

     year  price
0  2000.0   11.0
1  2002.0   13.0
2  2003.0   13.0
3  2004.0   14.0
4  2005.0   17.0

In [260]:
x =df.loc[df.year==2000.0,'price']
x

0    11.0
Name: price, dtype: float64

In [261]:
df['sales']=[21,21,55,23,23]
df

     year  price  sales
0  2000.0   11.0     21
1  2002.0   13.0     21
2  2003.0   13.0     55
3  2004.0   14.0     23
4  2005.0   17.0     23

In [262]:

g = df.groupby('sales')
g = g.filter(lambda x:len(x)>1)
g

     year  price  sales
0  2000.0   11.0     21
1  2002.0   13.0     21
3  2004.0   14.0     23
4  2005.0   17.0     23